/*
Пришло время добавить класс в финансовое приложение.
Сейчас весь код описан в одном классе Praktikum: и конвертация валют, и работа с тратами,
и взаимодействие с пользователем. В таком коде становится сложно ориентироваться.
Вы уже разбили его на методы, c помощью классов можно сделать его ещё проще.
Создайте пустой класс Converter. Позже в нём будет храниться вся логика, связанная с конвертацией валют.
 */
package javaCore1.classesAndObjects.task1;

// Объявите класс
public class Converter {
}
